# ============================================================================
# Brewfile — Declarative Homebrew package manifest
# Usage: brew bundle --file=Brewfile
# ============================================================================


# ============================================================================
# Core CLI
# ============================================================================

brew "nano"
brew "wget"
brew "curl"
brew "unzip"
brew "gzip"
brew "unar"
brew "grep"
brew "rsync"
brew "cmake"

# ============================================================================
# Modern CLI Replacements
# ============================================================================

brew "bat"          # cat replacement
brew "dust"         # du replacement
brew "eza"          # ls replacement
brew "fd"           # find replacement
brew "ripgrep"      # grep replacement
brew "sd"           # sed replacement
brew "fzf"          # fuzzy finder
brew "hexyl"        # hex viewer
brew "hyperfine"    # benchmarking
brew "xsv"          # CSV toolkit
brew "viu"          # image viewer (terminal)
brew "ncdu"         # disk usage (interactive)
brew "bottom"       # top/htop replacement
brew "htop"         # process viewer
brew "tealdeer"     # tldr pages
brew "trash"        # rm to trash

# ============================================================================
# Shell & Prompt
# ============================================================================

brew "zsh"
brew "zsh-completions"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "bash"
brew "bash-completion@2"
brew "starship"     # cross-shell prompt
brew "zoxide"       # smarter cd
brew "direnv"       # per-directory env vars

# ============================================================================
# Git Tools
# ============================================================================

brew "git"
brew "git-lfs"
brew "git-delta"    # diff pager
brew "git-filter-repo"
brew "gh"           # GitHub CLI
brew "tig"          # git TUI
brew "lazygit"      # git TUI (interactive)

# ============================================================================
# Development
# ============================================================================

brew "jq"           # JSON processor
brew "yq"           # YAML processor
brew "glow"         # markdown renderer (terminal)
brew "pv"           # pipe viewer
brew "shellcheck"   # shell linter
brew "shfmt"        # shell formatter
brew "watchman"     # file watcher
brew "editorconfig" # editor config support
brew "pstree"       # process tree
brew "tokei"        # code statistics
brew "fdupes"       # duplicate file finder
brew "entr"         # file watcher (run on change)
brew "dos2unix"     # line ending conversion
brew "rename"       # bulk rename
brew "watch"        # repeat commands
brew "vim"
brew "tmux"
brew "asdf"         # version manager
brew "mas"          # Mac App Store CLI

# ============================================================================
# Security & Encryption
# ============================================================================

brew "gnupg"
brew "pinentry-mac"
brew "age"          # modern file encryption
brew "openssh"
brew "ssh-copy-id"

# ============================================================================
# Databases
# ============================================================================

brew "postgresql@17" # PostgreSQL server
brew "libpq"         # PostgreSQL client library
brew "pgcli"         # PostgreSQL CLI with autocomplete
brew "pgformatter"   # SQL formatter
brew "redis"

# ============================================================================
# Network
# ============================================================================

brew "httpie"       # HTTP client
brew "nmap"         # network scanner
brew "mitmproxy"    # HTTP proxy/inspector
brew "mtr"          # traceroute + ping
brew "doggo"        # DNS client
brew "telnet"

# ============================================================================
# Build Dependencies (asdf Erlang/Elixir)
# ============================================================================

brew "autoconf"
brew "automake"
brew "wxwidgets"
brew "openssl"
brew "libyaml"
brew "readline"
brew "libxslt"
brew "libtool"
brew "unixodbc"
brew "sqlite3"
brew "xz"
brew "zlib"

# ============================================================================
# Archiving
# ============================================================================

brew "p7zip"        # 7z support

# ============================================================================
# === Optional: GNU Coreutils ===
# Modern replacements (fd, sd, ripgrep, eza) cover most use cases.
# Uncomment if you need GNU-compatible flags in scripts.
# ============================================================================

# brew "coreutils"
# brew "moreutils"
# brew "findutils"
# brew "diffutils"
# brew "gnu-sed"
# brew "gnu-tar"
# brew "gawk"

# ============================================================================
# === Optional: Media Tools ===
# Install ad-hoc when needed. Uncomment for a full media workstation.
# ============================================================================

# brew "ffmpeg"
# brew "ffmpegthumbnailer"
# brew "exiftool"
# brew "imagemagick"
# brew "imageoptim-cli"
# brew "figlet"
# brew "asciinema"
# brew "yt-dlp"
# brew "transmission-cli"
# brew "pdfgrep"
# brew "graphviz"
# brew "gnuplot"
# brew "yasm"
# brew "x264"
# brew "lame"
# brew "xvid"

# ============================================================================
# Casks: Terminal & Editor
# ============================================================================

cask "ghostty"
cask "vscodium"

# ============================================================================
# Casks: Browsers
# ============================================================================

cask "brave-browser"
cask "firefox"

# === Optional: Google Chrome ===
# Telemetry-heavy — Brave + Firefox cover most browsing needs.
# cask "google-chrome"

# ============================================================================
# Casks: Dev Tools
# ============================================================================

brew "docker"       # Docker CLI only
brew "docker-compose"
brew "colima"       # Container runtime (replaces Docker Desktop)
cask "ngrok"
cask "tableplus"

# ============================================================================
# Casks: Utilities
# ============================================================================

cask "rectangle"    # Window snapping
cask "aerospace"    # Tiling window manager
cask "karabiner-elements" # Keyboard remapping
cask "appcleaner"   # Clean uninstalls
cask "keka"         # Archive utility
cask "mullvad-vpn"  # VPN
cask "utm"          # Virtual machines
cask "qlmarkdown"   # Quick Look markdown preview
cask "crystalfetch" # macOS installer downloader
cask "tailscale"    # Mesh VPN

# === Optional: Proprietary Apps ===
# Uncomment based on personal preference.

# cask "1password"  # FOSS alternative: Bitwarden
# cask "obsidian"   # FOSS alternative: Logseq
# cask "raycast"    # No strong FOSS launcher alternative on macOS

# ============================================================================
# Casks: Claude
# ============================================================================

cask "claude"
cask "claude-code"

# ============================================================================
# Fonts
# ============================================================================

cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
